import "../CSS/customizePizza.css";
const PopUp = ({onclose}) => {
  return (
    <>
      <div className="popup-container">
        <h2>🍕 راهنمای استفاده از بخش ساخت پیتزا</h2>
        <span>
          به دنیای خوشمزه‌ی پیتزا خوش اومدی! 😋
          <br />
          در این بخش می‌تونی پیتزای رؤیایی‌ات رو خودت طراحی کنی! 🧑‍🍳👇
          <br />
          <b>🔸 درگ و دراپ کن!</b>
          <br />
          مواد مختلف مثل فلفل دلمه‌ای 🌶، گوجه 🍅، قارچ 🍄 و زیتون🫒 رو از نوار
          کناری بگیر و روی پیتزا بنداز!
          <br />
          <b>🔸 کلیک کن تا حذف شه!</b>
          <br />
          اگه از چیزی پشیمون شدی، فقط روش دوبار کلیک کن تا حذف بشه❌
          <br />
          <b>🔸 تنظیم مقدار فلفل 🌶 و پنیر پیتزا 🧀</b>
          <br />
          با اسلایدرها میزان تندی یا پنیر پیتزات رو تنظیم کن!
          <br />
          <b>🔸 سایز نون پیتزا رو انتخاب کن 🍞</b>
          <br />
          دوست داری پیتزات بزرگ باشه یا جمع‌وجور؟ اندازه نون رو به دلخواهت
          انتخاب کن!
          <br />
          <hr />
          همه چیز دست خودته! یه پیتزای خاص برای خودت بساز و لذت ببر! 😍🍕 بزن
          بریم! 🚀
          <br />
        </span>
        <button onClick={onclose}>بزن بریم</button>
        <br />
      </div>
    </>
  );
};

export default PopUp;
